# Pandas

In [ ]:
Pandas 는 구조적 데이터 표시와 초리에 강하다
파이썬이 데이터를 손쉽게 처리할수 있도록 도와주는 것이 pandas 라이브러리아다.
pandas 는 Numpy를 기반으로 만들어 졌지만 더 복잡한 데이터 분석에 특화돼있다.
Numpy은 같은 데이터 타입의 배열만 처리할수 있는데 pandas 는 데이터 타입이 다양하게
섞여 있을때도 처리가능하다.

###  판다스의 할용법

####  pandas를 이용해 데이터 생성법.

####  1 series를 활용한 데이터 생성

In [ ]:
Numpy 와 같이 pandas도 'import ~ as ~' 형식으로 불러온다.

In [1]:
import pandas as pd

In [ ]:
위에 코드는 pandas 를 불러오고 pandas 를 이용할때 pandas 대신 pd 를 씀.

In [ ]:
pandas의 기본적인 데이터 생산방법은 Series() 를 이용하는것.
series 형식의 구조적 데이터 (1차원 데이터를) 생성할 수 있다.

In [ ]:
Series()의 인자로는 sequence data 가 들어 간다 - list를 사용하자.
예를 들면

In [9]:
s1 = pd.Series([10,20,30,40,50])
s1

0    10
1    20
2    30
3    40
4    50
dtype: int64

In [ ]:
위와 같이 Series 데이터 출력하면 앞에 index가 함께표시된다.
Series 데이터는 index와 values를 분리해서 가져올수 있다.
Series데이터를 s라고 할때 index는 's.index'로 values는 's.values' 로 가져올수 있다.
다음은 앞에서 만든 Series 데이터에서 index를 가져 온 예다.

In [5]:
s1.index
print(s1.index)

RangeIndex(start=0, stop=5, step=1)

In [ ]:
위와 같이 index 범위를 표시해준다.
다음은 Series 데이터에서 values를 가져와 본다

In [6]:
s1.values

array([10, 20, 30, 40, 50], dtype=int64)

In [ ]:
출력된 결과가 NumPy의 배열과 형식이 같다.

In [ ]:
Numpy와는 다르게 pandas의 경우 데이터 타입이 달라도 된다.
따라서 Series() 데이터를 혼합된 리스트를 사용할수 있다.

In [8]:
s2 = pd.Series(['a','b','c',1,2,3])
s2

0    a
1    b
2    c
3    1
4    2
5    3
dtype: object

In [ ]:
**데이터가 없으면 NumPy를 import 한후에 np.nan으로 데이터가 없다고 표시할수도 있다. 예를들면

In [9]:
import numpy as np

In [11]:
s3=pd.Series([np.nan,10,30])
s3

0     NaN
1    10.0
2    30.0
dtype: float64

In [ ]:
출력 결과 NaN 은 데이터가 없다는것을 의미 하지만 index 자리는 있지만 값은 없다.*

In [ ]:
Series 데이터를 생성할 때 다음과 같이 인자로 index를 추가할 수 있다.
s = pd.Series(seq_data,index=index_seq)
여기서 index자동생선 대신 index_seq 가 들어간다.
주의 할점은 seq_data의 항목 개수와 index_seq의 항목 개수가 같아야 한다.

In [ ]:
다음 예제는 어느 가게의 날짜별 판매량을 pandas의 Series 형식으로 입력한 것이다. 
하루는 판매량 데이터가 없어서 np.nan를 입력했다.

In [12]:
index_date = ['2018-10-07', '2018-10-08','2018-10-09','2018-10-10']
s4=pd.Series([200,195,np.nan,205], index=index_date)
s4

2018-10-07    200.0
2018-10-08    195.0
2018-10-09      NaN
2018-10-10    205.0
dtype: float64

In [ ]:
출렬 결과는 index에 임력한 index_date의 리스트 데이터가 지정됐다.

In [ ]:
앞에서는 리스트 형식의 데이터와 index를 따로 입력했지만 
파이썬의 딕셔너리를 이용하면 데이터와 index를 함께 입력할 수 있다.

In [ ]:
s = pd.Series(dict_data)

In [ ]:
위와 같이 딕셔너리 데이터를 입력하면 딕셔너리 데이터의 키(keys)와 값(values)이 
각각 Series 데이터의 index와 values로 들어간다.

In [13]:
s5 = pd.Series({'국어': 100, '영어': 95, '수학': 90})
s5

국어    100
영어     95
수학     90
dtype: int64

In [ ]:
위의 Series 데이터의 index는 '국어','영어','수학'으로 지정됐고
value 는 100,90,95

In [ ]:
날짜 자동 생성: date_range
앞에서 index에 일일이 날짜를 입력하지않고. pandas 에서재공하는 date_range()를 쓰자
pd.date_range(start=None, end=None, periods=None, freq='d')
start 는 시작날짜, end는 끝 날짜, periods는 날짜 데이터 생성기간, 
freq는 날짜 데이터 생성주기 start는 무조건 있어야하고 
end나 periods는 둘중하나만 있어도 된다
freq를 입력하지 않으면 'D' 옵션이 설정돼 달력 날짜 기준으로 하루식 증가한다.

In [14]:
pd.date_range(start='2019-01-01',end='2019-01-07')

DatetimeIndex(['2019-01-01', '2019-01-02', '2019-01-03', '2019-01-04',
               '2019-01-05', '2019-01-06', '2019-01-07'],
              dtype='datetime64[ns]', freq='D')

In [ ]:
날짜를 입력할 때 yyyy-mm-dd 형식 외에도 yyyy/mm/dd, yyyy.mm.dd, 
mm-dd-yyyy, mm/dd/yyyy, mm.dd.yyyy 같은 형식으로도 입력할 수 있다. 
그러나 생성된 날짜 데이터 형식은 모두 yyyy-mm-dd 이다.

In [15]:
pd.date_range(start='2019/01/01',end='2019.01.07')

DatetimeIndex(['2019-01-01', '2019-01-02', '2019-01-03', '2019-01-04',
               '2019-01-05', '2019-01-06', '2019-01-07'],
              dtype='datetime64[ns]', freq='D')

In [16]:
pd.date_range(start='01-01-2019',end='01/07/2019')

DatetimeIndex(['2019-01-01', '2019-01-02', '2019-01-03', '2019-01-04',
               '2019-01-05', '2019-01-06', '2019-01-07'],
              dtype='datetime64[ns]', freq='D')

In [17]:
pd.date_range(start='2019-01-01',end='01.07.2019')

DatetimeIndex(['2019-01-01', '2019-01-02', '2019-01-03', '2019-01-04',
               '2019-01-05', '2019-01-06', '2019-01-07'],
              dtype='datetime64[ns]', freq='D')

In [18]:
pd.date_range(start='2019-01-01', periods = 7)

DatetimeIndex(['2019-01-01', '2019-01-02', '2019-01-03', '2019-01-04',
               '2019-01-05', '2019-01-06', '2019-01-07'],
              dtype='datetime64[ns]', freq='D')

In [19]:
pd.date_range(start='2019-01-01', periods = 4, freq ='2D')

DatetimeIndex(['2019-01-01', '2019-01-03', '2019-01-05', '2019-01-07'], dtype='datetime64[ns]', freq='2D')

In [21]:
pd.date_range(start='2019-01-01', periods = 4, freq ='W')
#일요일만 나옴

DatetimeIndex(['2019-01-06', '2019-01-13', '2019-01-20', '2019-01-27'], dtype='datetime64[ns]', freq='W-SUN')

In [22]:
pd.date_range(start='2019-01-01', periods = 12, freq ='2BM')

DatetimeIndex(['2019-01-31', '2019-03-29', '2019-05-31', '2019-07-31',
               '2019-09-30', '2019-11-29', '2020-01-31', '2020-03-31',
               '2020-05-29', '2020-07-31', '2020-09-30', '2020-11-30'],
              dtype='datetime64[ns]', freq='2BM')

In [23]:
pd.date_range(start='2019-01-01', periods = 4, freq ='QS')

DatetimeIndex(['2019-01-01', '2019-04-01', '2019-07-01', '2019-10-01'], dtype='datetime64[ns]', freq='QS-JAN')

In [24]:
pd.date_range(start='2019-01-01', periods = 3, freq ='AS')

DatetimeIndex(['2019-01-01', '2020-01-01', '2021-01-01'], dtype='datetime64[ns]', freq='AS-JAN')

In [28]:
pd.date_range(start='2019-01-01 08:00', periods = 10, freq ='H')

DatetimeIndex(['2019-01-01 08:00:00', '2019-01-01 09:00:00',
               '2019-01-01 10:00:00', '2019-01-01 11:00:00',
               '2019-01-01 12:00:00', '2019-01-01 13:00:00',
               '2019-01-01 14:00:00', '2019-01-01 15:00:00',
               '2019-01-01 16:00:00', '2019-01-01 17:00:00'],
              dtype='datetime64[ns]', freq='H')

In [ ]:
위의 예는 1시간 주기로 10개

In [29]:
pd.date_range(start='2019-01-01 08:00', periods = 10, freq ='BH')

DatetimeIndex(['2019-01-01 09:00:00', '2019-01-01 10:00:00',
               '2019-01-01 11:00:00', '2019-01-01 12:00:00',
               '2019-01-01 13:00:00', '2019-01-01 14:00:00',
               '2019-01-01 15:00:00', '2019-01-01 16:00:00',
               '2019-01-02 09:00:00', '2019-01-02 10:00:00'],
              dtype='datetime64[ns]', freq='BH')

In [30]:
pd.date_range(start='2019-01-01 10:00', periods = 4, freq ='30min')
# min 단위 이지만 출력은 T 로 나온다.

DatetimeIndex(['2019-01-01 10:00:00', '2019-01-01 10:30:00',
               '2019-01-01 11:00:00', '2019-01-01 11:30:00'],
              dtype='datetime64[ns]', freq='30T')

In [31]:
pd.date_range(start='2019-01-01 10:00', periods = 4, freq ='30T')

DatetimeIndex(['2019-01-01 10:00:00', '2019-01-01 10:30:00',
               '2019-01-01 11:00:00', '2019-01-01 11:30:00'],
              dtype='datetime64[ns]', freq='30T')

In [32]:
pd.date_range(start='2019-01-01 10:00:00', periods = 4, freq ='10S')

DatetimeIndex(['2019-01-01 10:00:00', '2019-01-01 10:00:10',
               '2019-01-01 10:00:20', '2019-01-01 10:00:30'],
              dtype='datetime64[ns]', freq='10S')

In [33]:
index_date = pd.date_range(start='2019-01-01', periods = 5, freq ='D')
pd.Series([51, 62, 55, 49, 58], index = index_date)

2019-01-01    51
2019-01-02    62
2019-01-03    55
2019-01-04    49
2019-01-05    58
Freq: D, dtype: int64

## 3 DataFrame 을 활용한 데이터 생성

In [ ]:
DataFrame은 이름과 같이 자료(Data)를 담는 틀(Frame)이다.
DataFrame을 이용하면 라벨(Label)이 있는 2차원 데이터를 생성하고 처리할수 있다

In [ ]:
다음은 DataFrame을 이용해 데이터를 생성하는 방법이다.
 df = pd.DataFrame(data [, index = index_data, columns = columns_data])

In [ ]:
DataFrame 데이터를 생성하는 예를 살펴보겠다. 
우선 리스트를 이용해 DataFrame의 데이터를 생성하는 예이다.

In [1]:
import pandas as pd

pd.DataFrame([[1, 2, 3], [4, 5, 6], [7, 8, 9]])

   0  1  2
0  1  2  3
1  4  5  6
2  7  8  9

In [ ]:
다음은 NumPy의 배열 데이터를 입력해 생성한 DataFrame 데이터의 예이다.

In [2]:
import numpy as np
import pandas as pd

 
data_list = np.array([[10, 20, 30], [40, 50, 60], [70, 80, 90]])
pd.DataFrame(data_list)

    0   1   2
0  10  20  30
1  40  50  60
2  70  80  90

In [ ]:
이번에는 data 뿐만 아니라 index와 columns도 지정해 보겠다.

In [3]:
import numpy as np
import pandas as pd

 

data = np.array([[1, 2, 3], [4, 5, 6], [7, 8, 9], [10, 11, 12]])

index_date = pd.date_range('2019-09-01',periods=4)

columns_list = ['A', 'B', 'C']

pd.DataFrame(data, index=index_date, columns=columns_list) # 이코드가 index와 column을 너주는 코드

             A   B   C
2019-09-01   1   2   3
2019-09-02   4   5   6
2019-09-03   7   8   9
2019-09-04  10  11  12

In [ ]:
다음은 딕셔너리 타입으로 2차원 데이터를 입력한 예이다.

In [5]:
table_data = {'연도': [2015, 2016, 2017, 2017, 2017],

                  '지사': ['한국', '한국', '미국', '한국', '미국'],

                  '고객 수': [200, 250, 450, 300, 500]}

table_data

{'연도': [2015, 2016, 2017, 2017, 2017],
 '지사': ['한국', '한국', '미국', '한국', '미국'],
 '고객 수': [200, 250, 450, 300, 500]}

In [ ]:
이제 위에서 만든 딕셔너리 데이터를 이용해 DataFrame 형식의 데이터를 생성하겠다.

In [6]:
pd.DataFrame(table_data)

     연도  지사  고객 수
0  2015  한국   200
1  2016  한국   250
2  2017  미국   450
3  2017  한국   300
4  2017  미국   500

In [9]:
df = pd.DataFrame(table_data, columns=['연도','지사', '고객 수' ])
df

     연도  지사  고객 수
0  2015  한국   200
1  2016  한국   250
2  2017  미국   450
3  2017  한국   300
4  2017  미국   500

In [3]:
table_data1 = {'A': [1, 2, 3, 4, 5],
               'B': [10, 20, 30, 40, 50],
               'C': [100, 200, 300, 400, 500]}
df1 = pd.DataFrame(table_data1)
df1

   A   B    C
0  1  10  100
1  2  20  200
2  3  30  300
3  4  40  400
4  5  50  500

In [5]:
table_data3 = {'봄': [256.5, 264.3, 215.9, 223.2, 312.8],
               '여름': [770.6, 567.5, 599.8, 387.1, 446.2],
               '가을': [363.5, 231.2, 293.1, 247.7, 381.6],
               '겨울': [139.3, 59.9, 76.9, 109.1, 108.1]}
columns_list = ['봄', '여름', '가을', '겨울']
index_list = ['2012', '2013', '2014', '2015', '2016']

df3 = pd.DataFrame(table_data3, columns = columns_list, index = index_list)
df3

          봄     여름     가을     겨울
2012  256.5  770.6  363.5  139.3
2013  264.3  567.5  231.2   59.9
2014  215.9  599.8  293.1   76.9
2015  223.2  387.1  247.7  109.1
2016  312.8  446.2  381.6  108.1

In [6]:
df3.mean()

봄     254.54
여름    554.24
가을    303.42
겨울     98.66
dtype: float64

In [7]:
df3.std()

봄      38.628267
여름    148.888895
가을     67.358496
겨울     30.925523
dtype: float64

In [10]:
df3.mean(axis=1) #그 년도에 mean 값

2012    382.475
2013    280.725
2014    296.425
2015    241.775
2016    312.175
dtype: float64

In [11]:
df3.std(axis=1)

2012    274.472128
2013    211.128782
2014    221.150739
2015    114.166760
2016    146.548658
dtype: float64

In [12]:
df3.describe()

                봄          여름          가을          겨울
count    5.000000    5.000000    5.000000    5.000000
mean   254.540000  554.240000  303.420000   98.660000
std     38.628267  148.888895   67.358496   30.925523
min    215.900000  387.100000  231.200000   59.900000
25%    223.200000  446.200000  247.700000   76.900000
50%    256.500000  567.500000  293.100000  108.100000
75%    264.300000  599.800000  363.500000  109.100000
max    312.800000  770.600000  381.600000  139.300000

In [ ]:
데이터 pandas 에서 원하는 부분만 선택하는 방법.

우선 DataFrame 을 생선해보자

In [2]:
import pandas as pd
import numpy as np

 

KTX_data = {'경부선 KTX': [39060, 39896, 42005, 43621, 41702, 41266, 32427],
            '호남선 KTX': [7313, 6967, 6873, 6626, 8675, 10622, 9228],
            '경전선 KTX': [3627, 4169, 4088, 4424, 4606, 4984, 5570],
            '전라선 KTX': [309, 1771, 1954, 2244, 3146, 3945, 5766],
            '동해선 KTX': [np.nan,np.nan, np.nan, np.nan, 2395, 3786, 6667]}
col_list = ['경부선 KTX', '호남선 KTX', '경전선 KTX', '전라선 KTX', '동해선 KTX']
index_list = ['2011', '2012', '2013', '2014', '2015', '2016', '2017']
df_KTX = pd.DataFrame(KTX_data, columns = col_list, index = index_list)
df_KTX

      경부선 KTX  호남선 KTX  경전선 KTX  전라선 KTX  동해선 KTX
2011    39060     7313     3627      309      NaN
2012    39896     6967     4169     1771      NaN
2013    42005     6873     4088     1954      NaN
2014    43621     6626     4424     2244      NaN
2015    41702     8675     4606     3146   2395.0
2016    41266    10622     4984     3945   3786.0
2017    32427     9228     5570     5766   6667.0

In [ ]:
우선 DataFrame 데이터의 index, columns, values를 확인하려면 
다음과 같이 작성하면 된다

In [3]:
df_KTX.index

Index(['2011', '2012', '2013', '2014', '2015', '2016', '2017'], dtype='object')

In [4]:
df_KTX.columns

Index(['경부선 KTX', '호남선 KTX', '경전선 KTX', '전라선 KTX', '동해선 KTX'], dtype='object')

In [5]:
df_KTX.values

array([[39060.,  7313.,  3627.,   309.,    nan],
       [39896.,  6967.,  4169.,  1771.,    nan],
       [42005.,  6873.,  4088.,  1954.,    nan],
       [43621.,  6626.,  4424.,  2244.,    nan],
       [41702.,  8675.,  4606.,  3146.,  2395.],
       [41266., 10622.,  4984.,  3945.,  3786.],
       [32427.,  9228.,  5570.,  5766.,  6667.]])

In [ ]:
DataFrame_data.head([n])  #첫 몃줄 보기
DataFrame_data.tail([n]) # 마지막 몃줄 보기

In [6]:
df_KTX.head()

      경부선 KTX  호남선 KTX  경전선 KTX  전라선 KTX  동해선 KTX
2011    39060     7313     3627      309      NaN
2012    39896     6967     4169     1771      NaN
2013    42005     6873     4088     1954      NaN
2014    43621     6626     4424     2244      NaN
2015    41702     8675     4606     3146   2395.0

In [7]:
df_KTX.tail()

      경부선 KTX  호남선 KTX  경전선 KTX  전라선 KTX  동해선 KTX
2013    42005     6873     4088     1954      NaN
2014    43621     6626     4424     2244      NaN
2015    41702     8675     4606     3146   2395.0
2016    41266    10622     4984     3945   3786.0
2017    32427     9228     5570     5766   6667.0

In [ ]:
자 인재 진짜
데이터 pandas 에서 원하는 부분만 선택해보자.
DataFrame 데이터에서 연속된 구간의 행 데이터를 선택하려면 
다음과 같이 '행 시작 위치'와 '끝 위치'를 지정한다.
DataFrame_data[행_시작_위치:행_끝_위치]

In [8]:
#df_KTX = pd.DataFrame(KTX_data, columns = col_list, index = index_list)
#를 이용한다
df_KTX[1:2]

      경부선 KTX  호남선 KTX  경전선 KTX  전라선 KTX  동해선 KTX
2012    39896     6967     4169     1771      NaN

In [9]:
df_KTX[2:5]

      경부선 KTX  호남선 KTX  경전선 KTX  전라선 KTX  동해선 KTX
2013    42005     6873     4088     1954      NaN
2014    43621     6626     4424     2244      NaN
2015    41702     8675     4606     3146   2395.0

In [ ]:
데이터에서 하나의 열만 선택하려면 다음과같이 하나의 columns 항목 이름을 지정한다.
DataFrame_data[column_name]

In [10]:
df_KTX['경부선 KTX']

2011    39060
2012    39896
2013    42005
2014    43621
2015    41702
2016    41266
2017    32427
Name: 경부선 KTX, dtype: int64

다음과 같이 DataFrame 데이터에서 하나의 열을 선택한 후 index의 범위를 지정해 원하는 데이터만 선택할 수도 있다.

DataFrame_data[column_name][start_index_name:end_index_name] 
DataFrame_data[column_name][start_index_pos:end_index_name] 

여기서 column_name으로 하나의 열을 선택한 후 'start_index_name:end_index_name'으로 index의 이름을 지정해 index의 범위를 선택할 수도 있고, 'start_index_pos:end_index_pos'로 index의 위치를 지정해 index의 범위를 선택할 수도 있다. index의 위치는 0부터 시작한다.


다음은 df_KTX에서 '경부선 KTX'로 열을 선택한 후 2012년에서 2014년까지 index의 범위를 index의 이름으로 지정한 예이다.

In [11]:
df_KTX['경부선 KTX']['2012':'2014']

2012    39896
2013    42005
2014    43621
Name: 경부선 KTX, dtype: int64

다음은 index의 위치로 범위를 지정한 예이다.

In [12]:
df_KTX['경부선 KTX'][2:5]

2013    42005
2014    43621
2015    41702
Name: 경부선 KTX, dtype: int64

어떤 방법으로 index의 범위를 지정해도 원하는 범위의 데이터를 선택할 수 있다.

DataFrame 데이터 중 하나의 원소만 선택하려면 다음 방법 중 하나를 이용하면 된다.

DataFrame_data.loc[index_name][column_name] 

DataFrame_data.loc[index_name, column_name] 

DataFrame_data[column_name][index_name] 

DataFrame_data[column_name][index_pos]

DataFrame_data[column_name].loc[index_name]
예를 들어 변수 df_KTX에서 2016년의 '호남선 KTX'의 이용자 수를 선택하려면 다음과 같이 여러 방법으로 수행할 수 있다.

In [13]:
df_KTX.loc['2016']['호남선 KTX']

10622.0

In [14]:
df_KTX.loc['2016','호남선 KTX']

10622

In [15]:
df_KTX['호남선 KTX']['2016']

10622

In [16]:
df_KTX['호남선 KTX'][5]

10622

In [17]:
df_KTX['호남선 KTX'].loc['2016']

10622

지금까지 원하는 데이터를 추출하는 방법을 살펴봤다. 이어서 DataFrame 데이터의 행과 열을 바꾸는 방법을 살펴보겠다. 행렬에서 행과 열을 바꾸는 것을 "전치" 라고 한다. pandas에서는 다음과 같은 방법으로 DataFrame 데이터의 전치를 구할 수 있다.

In [19]:
#DataFrame_data.T 
df_KTX.T

            2011     2012     2013     2014     2015     2016     2017
경부선 KTX  39060.0  39896.0  42005.0  43621.0  41702.0  41266.0  32427.0
호남선 KTX   7313.0   6967.0   6873.0   6626.0   8675.0  10622.0   9228.0
경전선 KTX   3627.0   4169.0   4088.0   4424.0   4606.0   4984.0   5570.0
전라선 KTX    309.0   1771.0   1954.0   2244.0   3146.0   3945.0   5766.0
동해선 KTX      NaN      NaN      NaN      NaN   2395.0   3786.0   6667.0

In [20]:
df_KTX

      경부선 KTX  호남선 KTX  경전선 KTX  전라선 KTX  동해선 KTX
2011    39060     7313     3627      309      NaN
2012    39896     6967     4169     1771      NaN
2013    42005     6873     4088     1954      NaN
2014    43621     6626     4424     2244      NaN
2015    41702     8675     4606     3146   2395.0
2016    41266    10622     4984     3945   3786.0
2017    32427     9228     5570     5766   6667.0

DataFrame 데이터 변수 df_KTX에 열의 항목을 지정해 열의 순서를 다음과 같이 변경하겠다.

In [21]:
df_KTX[['동해선 KTX', '전라선 KTX', '경전선 KTX', '호남선 KTX', '경부선 KTX']]

      동해선 KTX  전라선 KTX  경전선 KTX  호남선 KTX  경부선 KTX
2011      NaN      309     3627     7313    39060
2012      NaN     1771     4169     6967    39896
2013      NaN     1954     4088     6873    42005
2014      NaN     2244     4424     6626    43621
2015   2395.0     3146     4606     8675    41702
2016   3786.0     3945     4984    10622    41266
2017   6667.0     5766     5570     9228    32427

데이터 통합하기


이번에는 두 개의 데이터를 하나로 통합하는 방법을 살펴보겠다. 통합 방법에는 세로로(index 증가 방향) 증가하는 방향으로 통합하기, 가로로(columns 증가 방향) 증가하는 방향으로 통합하기, 특정 열을 기준으로 통합하는 방법이 있다.


①세로방향으로 통합하기

DataFrame에서 columns가 같은 두 데이터를 세로 방향(index 증가 방향)으로 합하려면 다음과 같이 'append()'를 이용한다.

DataFrame_data1.append(DataFrame_data2 [,ignore_index=True])

위와 같이 실행하면 세로 방향으로 DataFrame_data1 다음에 DataFrame_data2가 추가돼서 DataFrame 데이터로 반환된다. 여기서 'ignore_index=True'를 입력하면 생성된 DataFrame 데이터에는 데이터 순서대로 새로운 index가 할당된다.

이를 확인하기 위해 다음과 같이 두 개의 DataFrame 데이터를 생성하겠다. 먼저 두 학급의 시험 점수가 담긴 DataFrame 데이터(df1)를 다음과 같이 생성하겠다.

In [24]:
import pandas as pd
import numpy as np

df1 = pd.DataFrame({'Class1': [95, 92, 98, 100],
                    'Class2': [91, 93, 97, 99]})
print(df1)

df2 = pd. DataFrame({'Class1': [87, 89],
                     'Class2': [85, 90]})
print(df2)

   Class1  Class2
0      95      91
1      92      93
2      98      97
3     100      99
   Class1  Class2
0      87      85
1      89      90

이제 'append()'이용해 df1에 df2를 추가해서 데이터를 하나로 만들어 보겠다.

In [25]:
df1.append(df2)

   Class1  Class2
0      95      91
1      92      93
2      98      97
3     100      99
0      87      85
1      89      90

보다시피 기존 데이터 df1에 세로 방향으로 df2가 추가됐는데 생성된 데이터의 index가 기존의 index와 같은 것을 볼 수 있다. 생성된 데이터에서 순차적으로 index가 증가하게 하려면 옵션으로 'ignore_index=True'를 입력하면 된다.

In [27]:
df1.append(df2, ignore_index=True)
#두 개의 DataFrame 데이터가 합쳐지고 index가 순차적으로 증가해 
#하나의 데이터처럼 만들어졌다.

   Class1  Class2
0      95      91
1      92      93
2      98      97
3     100      99
4      87      85
5      89      90

만약 columns가 같지 않은 DataFrame 데이터를 'append()'를 이용하여 추가한다면 데이터가 없는 부분은 NaN으로 채워진다. 이를 확인하기 위해 다음과 같이 열이 하나만 있는 DataFrame 데이터(df3)를 생성하겠다.

In [28]:
df3 = pd.DataFrame({'Class1':[96,83]})
df3

   Class1
0      96
1      83

In [31]:
df2 = pd. DataFrame({'Class1': [87, 89],
                     'Class2': [85, 90]})
df2

   Class1  Class2
0      87      85
1      89      90

In [29]:
df2.append(df3, ignore_index=True)

   Class1  Class2
0      87    85.0
1      89    90.0
2      96     NaN
3      83     NaN

In [ ]:
#결과에서 볼 수 있듯이 데이터가 없는 부분은 NaN으로 채워졌다.

②가로 방향 통합하기

앞에서는 columns가 같은 두 DataFrame 데이터에 대해 세로 방향(index 증가 방향)으로 데이터를 추가하는 방법을 살펴봤다. 이제 indes가 같은 두 DataFrame 데이터에 대해 가로 방향(columns 증가 방향)에 새로운 데이터를 추가하는 방법을 알아보겠다. 두 개의 DataFrame 데이터를 가로 방향으로 합치려면 다음과 같이 'join()'을 이용한다.

DataFrame_data1.join(DataFrame_data2_ 

위와 같이 작성하면 DataFrame_data1 다음에 가로 방향으로 DataFrame_data2가 추가돼서 DataFrame 데이터로 반환된다.

다음으로 'join()'을 이용한 예를 살펴보겠다. 우선 다음과 같이 df1과 index 방향으로 크기가 같은 DataFrame 데이터 하나를 생성한다.

In [32]:
df4 = pd.DataFrame({'Class3': [93, 91, 95, 98]})
df4

   Class3
0      93
1      91
2      95
3      98

In [33]:
df1.join(df4)

   Class1  Class2  Class3
0      95      91      93
1      92      93      91
2      98      97      95
3     100      99      98

다음과 같이 index 라벨을 지정한 DataFrame의 데이터의 경우에도 index가 같으면 'join()'을 이용해 가로 방향으로 데이터를 추가할 수 있다.

In [34]:
index_label = ['a', 'b', 'c', 'd']
df1a = pd.DataFrame({'Class1': [95, 92, 98, 100],
                     'Class2': [91, 93, 97, 99]}, index=index_label)
df4a = pd.DataFrame({'Class3': [93, 91, 95, 98]}, index=index_label)
df1a.join(df4a)

   Class1  Class2  Class3
a      95      91      93
b      92      93      91
c      98      97      95
d     100      99      98

만약 index의 크기가 다른 DataFrame 데이터를 'join()'을 이용해 추가한다면 데이터가 없는 부분은 NaN으로 채워진다. 다음 예제를 보자

In [35]:
df5 = pd.DataFrame({'Class4': [82, 92]})
df5

   Class4
0      82
1      92

위와 같이 index의 크기가 2인 DataFrame 데이터(df5)를 'join( )'을 이용해 index 크기가 4인 DataFrame 데이터(df1)에 추가하겠다.

In [36]:
df1.join(df5)

   Class1  Class2  Class4
0      95      91    82.0
1      92      93    92.0
2      98      97     NaN
3     100      99     NaN

위의 결과처럼 index의 크기가 작은 DataFrame 데이터에서 원소가 없는 부분은 NaN으로 채워진다.

③특정 열을 기준으로 통합하기

 다음으로 두 개의 DataFrame 데이터를 특정 열을 기준으로 통합해 보겠다. 특정 열을 키라고 한다. 만약 두 개의 DataFrame 데이터에 공통된 열이 있다면 이 열을 기준으로 두 데이터를 다음과 같은 방법으로 통합할 수 있다.

DataFrame_left_data.merge(DataFrame_right_data)

이를 수행하면 왼쪽 데이터(DataFrame_left_data)와 오른쪽 데이터(DataFrame_right_data)가 공통된 열을 중심으로 좌우로 통합된다.

이를 확인하기 위해 우선 두 개의 DataFrame 데이터를 생성해 보겠다. 먼저 1월부터 4월까지 제품A와 제품B의 판매량 데이터를 변수 df_A_B에 할당하고 같은 기간 동안 제품C와 제품D의 판매량 데이터를 변수 df_C_D에 다음과 같이 할당하겠다.

In [37]:
df_A_B = pd.DataFrame({'제품A': [100, 150, 200, 130],
                       '제품B': [90, 110, 140, 170],
                       '판매월': ['1월', '2월', '3월', '4월']})
df_A_B

   제품A  제품B 판매월
0  100   90  1월
1  150  110  2월
2  200  140  3월
3  130  170  4월

In [38]:
df_C_D = pd.DataFrame({'판매월': ['1월', '2월', '3월', '4월'],
                       '제품C': [112, 141, 203, 134],
                       '제품D': [90, 110, 140, 170]})
df_C_D

  판매월  제품C  제품D
0  1월  112   90
1  2월  141  110
2  3월  203  140
3  4월  134  170

DataFrame 데이터 df_A_B와 df_C_D에 모두 있는 것이 '판매월'인 열 데이터이므로 이를 중심으로 두 DataFrame 데이터를 통합하려면 다음과 같이 작성하면 된다.

In [62]:
df_A_B.merge(df_C_D)

   제품A  제품B 판매월  제품C  제품D
0  100   90  1월  112   90
1  150  110  2월  141  110
2  200  140  3월  203  140
3  130  170  4월  134  170

In [63]:
newdf = df_A_B.merge(df_C_D)

In [64]:
#깔끔하게 판매월을 끝으로 정렬하기
newdf[['제품A','제품B','제품C','제품D','판매월']]

   제품A  제품B  제품C  제품D 판매월
0  100   90  112   90  1월
1  150  110  141  110  2월
2  200  140  203  140  3월
3  130  170  134  170  4월

위 결과는 두 데이터가 '판매월'을 기준으로 통합된 결과이다. 특정 열을 기준으로 두 DataFrame 데이터가 모두 값을 갖고 있을 때 특정 열을 기준으로 통합하는 방법을 살폈다.

두 개의 DataFrame 데이터가 특정 열을 기준으로 일부만 공통된 값을 갖는 경우에 통합하려면 다음과 같이 'merge()'에 선택 인자를 지정하면 왼다.

DataFrame_left_data.merge(DataFrame_right_data, how=merge_method, on=key_label) 

여기서 on 인자에는 통합하려는 기준이 되는 특정 열의 라벨 이름을 입력한다. on 인자를 입력하지 않으면 자동으로 두 데이터에서 공통적으로 포함된 열이 선택된다. how 인자에는 지정된 특정 열을 기준으로 통합 방법을 지정한다. 표 11-7은 how 선택 인자에 따라 달라지는 통합 방법을 설명한다.

이제 특정 열을 기준으로 일부만 공통 데이터를 가진 두 DataFrame 데이터를 통합한 예를 살펴보겠다. 이를 위해 다음과 같이 두 개의 DataFrame 데이터를 생성하겠다.

In [49]:
df_left = pd.DataFrame({'key':['A', 'B', 'C'], 'left': [1, 2, 3]})
df_left

  key  left
0   A     1
1   B     2
2   C     3

In [50]:
df_right = pd.DataFrame({'key':['A', 'B', 'd'], 'right': [4, 5, 6]})
df_right

  key  right
0   A      4
1   B      5
2   d      6

두 개의 데이터(df_left와 df_right)에서 특정 열의 일부('A'와 'B') 데이터는 공통으로 있고 나머지('C'와 'D')는 각각 한쪽에만 있다. 두 데이터를 이용해 다음과 같이 how의 인자를 변경하면 통합 결과가 어떻게 달라지는지 살펴보겠다.

In [42]:
df_left.merge(df_right, how='left', on='key')

  key  left  right
0   A     1    4.0
1   B     2    5.0
2   C     3    NaN

In [43]:
df_left.merge(df_right, how='right', on='key')

  key  left  right
0   A   1.0      4
1   B   2.0      5
2   d   NaN      6

In [44]:
df_left.merge(df_right, how='outer', on='key')

  key  left  right
0   A   1.0    4.0
1   B   2.0    5.0
2   C   3.0    NaN
3   d   NaN    6.0

In [45]:
df_left.merge(df_right, how='inner', on='key')

  key  left  right
0   A     1      4
1   B     2      5

예제에서 on 인자의 값은 key로 지정하고 how 인자의 값을 각각 left, right, outer, inner로 변경했다. 각각 출력된 결과를 보면 how 인자의 값에 따라 통합 결과가 달라지는 것을 볼 수 있다. 여기서 해당 항목에 데이터가 없는 경우는 NaN이 자동으로 입력됐다.

In [66]:
df_left[['key','left']].join(df_right[[ 'right']])
# 또다른 연결법

  key  left  right
0   A     1      4
1   B     2      5
2   C     3      6

데이터 파일을 읽고 쓰기

앞에서 파이썬에 기본적으로 제공하는 방법으로 파일을 읽고 쓰는 방법을 알아봤다. pandas는 표 형식의 데이터 파일을 DataFrame 형식의 데이터로 읽어오는 방법과 DataFrame 형식의 데이터를 표 형식으로 파일로 저장하는 편리한 방법을 제공한다.

①표 형식의 데이터 파일을 읽기

pandas에서는 표 형식의 데이터 파일을 읽어 오는 몇 가지 방법을 제공한다. 그 중 대표적인 read_csv()를 이용해 표 형식의 텍스트 데이터 파일을 읽는 방법을 살펴보겠다. read_csv()는 기본적으로 각 데이테 필드가 콤마(,)로 구분된 CSV(comma-separated vlues) 파일을 읽는데 이용한다. 또한 옵션을 지정하면 각 데이터 필드가 콤마 외의 구분자로 돼 있어도 데이터를 읽어올 수 있다.

다음은 read_csv()를 이용하는 방법이다.

DataFrame_data = pd.read_csv(file_name [, options])

file_name은 텍스트 파일의 이름으로 경로를 포함할 수도 있다. options는 선택 사항인데 이것에 대해서는 예제를 통해 자세히 살펴보겠다.

앞에서 작업 폴더인 'C:\myPyCode' 아래에 data 폴더를 만들었습니다. data 폴더 아래에 다음과 같이 csv 데이터 파일('sea_rain1.csv')을 생성한다.

In [69]:
%%writefile C:\Users\Nick\Desktop\Nick_Study\sea_rain1.csv
    연도, 동해, 남해, 서해, 전체
    1996,17.4629,17.2288,14.436,15.9067
    1997,17.4116,17.4092,14.8248,16.1526
    1998,17.5944,18.011,15.2512,16.6044
    1999,18.1495,18.3175,14.8979,16.6284
    2000,17.9288,18.1766,15.0504,16.6178

Writing C:\Users\Nick\Desktop\Nick_Study\sea_rain1.csv

In [76]:
s = pd.read_csv('C:/Users/Nick/Desktop/Nick_Study/sea_rain1.csv')
s.head()

       연도       동해       남해       서해       전체
0    1996  17.4629  17.2288  14.4360  15.9067
1    1997  17.4116  17.4092  14.8248  16.1526
2    1998  17.5944  18.0110  15.2512  16.6044
3    1999  18.1495  18.3175  14.8979  16.6284
4    2000  17.9288  18.1766  15.0504  16.6178

In [3]:
#예
s = pd.read_csv('C:/Users/user/Desktop/BigDataCourse/data/city.csv')

In [5]:
s

      City             Geolocation
0  Houston  29.7604° N, 95.3698° W
1   Dallas  32.7767° N, 96.7970° W
2   Austin  30.2672° N, 97.7431° W